#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: FortniteUI

#include "Basic.hpp"

#include "BlueprintContext_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "SocialTypes_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CommonUI_structs.hpp"
#include "CommonUI_classes.hpp"
#include "EpicCMSUIFramework_classes.hpp"
#include "FortniteUI_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Party_structs.hpp"


namespace SDK
{

// Class FortniteUI.FortSquadSlotsView
// 0x0088 (0x0298 - 0x0210)
class UFortSquadSlotsView : public UCommonUserWidget
{
public:
	uint8                                         Pad_210[0x10];                                     // 0x0210(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	UMulticastDelegateProperty_                   OnDifferentSquadSlotSelectedEvent;                 // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnRequestOpenSquadSlotEvent;                       // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                         IndexOfSelectedSquadSlot;                          // 0x0240(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSlotButtonsRequireSelection;                      // 0x0244(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInPreviewMode;                                    // 0x0245(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortCommittableButtonGroup*            SquadSlotButtonGroup;                              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_250[0x30];                                     // 0x0250(0x0030)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                           // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_290[0x8];                                      // 0x0290(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	class UFortSquadSlotSelectorButton* CreateAndAddSquadSlotButton(const int32 SquadSlotIndex, const struct FHomebaseSquadSlot& SquadSlotDefinition, class UWidget** OutSquadSlotButtonHost);
	void HandleButtonClicked(class UCommonButton* CommittedButton, int32 ButtonIndex);
	void HandleHoveredButtonChanged(class UCommonButton* HoveredButton, int32 ButtonIndex);
	void HandleSelectedButtonChanged(class UCommonButton* SelectedButton, int32 ButtonIndex);
	void SelectSlot(int32 SquadSlotIndex);
	void SetIdOfSquadToManageBP(const class FName& SquadId);
	void SetInPreviewMode(const bool bPreview);
	void SetIsSelectionLocked(const bool ShouldSelectionBeLocked);

	class FName GetIdOfSquadToManageBP() const;
	int32 GetIndexOfSelectedSquadSlot() const;
	bool TryGetStaticSquadDataBP(struct FHomebaseSquad* OutSquadData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotsView">();
	}
	static class UFortSquadSlotsView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotsView>();
	}
};

// Class FortniteUI.FortItemPickerBase
// 0x0068 (0x0278 - 0x0210)
class UFortItemPickerBase : public UCommonUserWidget
{
public:
	UMulticastDelegateProperty_                   OnSelectionChangedEvent;                           // 0x0210(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSelectionCommittedEvent;                         // 0x0220(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemHoveredEvent;                                // 0x0230(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnItemUnhovered;                                   // 0x0240(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UFortItemTileView*                      PickerTileView;                                    // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConfirmSelectionIfAlreadySelectedAfterOneClick;   // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UObject*                                NewlySelectedItem;                                 // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                           // 0x0268(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	bool CanItemBeComitted(const class UFortItem* ItemToCommit);
	void CenterSelectedItemTileWidget();
	void ClearSelection();
	void HandlePickerItemClicked(const class UObject* ObjectOfClickedTile);
	void HandlePickerItemDoubleClicked(const class UObject* ObjectOfClickedTile);
	void HandlePickerItemHovered(const class UObject* ObjectOfHoveredTile);
	void HandlePickerItemSelected(const class UObject* ObjectWhoseSelectionChanged, bool bIsSelected);
	void HandlePickerTileCreated(class UUserWidget* Widget);
	void HandlePickerTileDestroyed(class UUserWidget* Widget);
	bool SetSelectedIndex(int32 Index_0);
	void SetSelectedItem(const class UFortItem* ItemToSelect);
	bool TryCommitSelectedItem();

	int32 GetIndexForItem(class UObject* Item) const;
	class UFortItem* GetSelectedItem() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerBase">();
	}
	static class UFortItemPickerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerBase>();
	}
};

// Class FortniteUI.FortAsyncAction_ShowConfirmation
// 0x0188 (0x01B0 - 0x0028)
class UFortAsyncAction_ShowConfirmation final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnConfirmed;                                       // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnDeclined;                                        // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTimedOut;                                        // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UObject*                                WorldContextObject;                                // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FFortDialogDescription                 Description;                                       // 0x0060(0x0150)(ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UFortAsyncAction_ShowConfirmation* ShowConfirmationDialog(class UObject* InWorldContextObject, const class FText& Title, const class FText& MESSAGE, const class FText& ConfirmButtonText, const class FText& DeclineButtonText, class UFortUserWidget* InAdditionalContent, float InDisplayTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAsyncAction_ShowConfirmation">();
	}
	static class UFortAsyncAction_ShowConfirmation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAsyncAction_ShowConfirmation>();
	}
};

// Class FortniteUI.FortUIStateWidget_NUI
// 0x0020 (0x03E0 - 0x03C0)
class UFortUIStateWidget_NUI : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_3C0[0x8];                                      // 0x03C0(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FContentPushState>              StackStates;                                       // 0x03C8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void OnEnterState(EFortUIState PreviousUIState);
	void OnExitState(EFortUIState NextUIState);
	void OnFrontEndVisibilityUpdated(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PopAllContentWidgets();
	class UWidget* PopContentWidget();
	class UWidget* PopContentWidgetInternal(const struct FContentPushState& State);
	void PushContentWidget(class UWidget* Widget);
	void PushContentWidgetAdvanced(class UWidget* Widget, bool bHideHeader, bool bHideFooter, bool bHideChatWidget);
	void PushContentWidgetInternal(class UWidget* Widget, const struct FContentPushState& State);
	void SetFrontEndVisibility(bool bHideHeader, bool bHideFooter, bool bHideChatWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_NUI">();
	}
	static class UFortUIStateWidget_NUI* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_NUI>();
	}
};

// Class FortniteUI.FortUIStateWidget_Frontend
// 0x0000 (0x03E0 - 0x03E0)
class UFortUIStateWidget_Frontend : public UFortUIStateWidget_NUI
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateWidget_Frontend">();
	}
	static class UFortUIStateWidget_Frontend* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateWidget_Frontend>();
	}
};

// Class FortniteUI.AthenaAccountContext
// 0x0000 (0x0028 - 0x0028)
class UAthenaAccountContext final : public UBlueprintContextBase
{
public:
	void GetBattleBookPurchaseLimit(int32* MaxNumLevelsPossibleToPurchase, int32* BonusLevelsGranted);
	void SimulateBattleBookPurchase(int32 NumLevelsToPurchase, int32* BonusLevelsGranted, bool* bOverLimit);

	class FText GetCurrentSeasonName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaAccountContext">();
	}
	static class UAthenaAccountContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaAccountContext>();
	}
};

// Class FortniteUI.FortItemTileButton
// 0x0030 (0x07B0 - 0x0780)
class UFortItemTileButton : public UCommonButton
{
public:
	uint8                                         Pad_780[0x8];                                      // 0x0780(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               Item;                                              // 0x0790(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFortItemCardSize                             ItemCardSize;                                      // 0x0798(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsRewardCard;                                      // 0x0799(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79A[0x6];                                      // 0x079A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                           // 0x07A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemTileButton">();
	}
	static class UFortItemTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemTileButton>();
	}
};

// Class FortniteUI.FortAthenaMatchmakingWidget
// 0x00E8 (0x02F8 - 0x0210)
class UFortAthenaMatchmakingWidget : public UCommonUserWidget
{
public:
	TSubclassOf<class UFortMissionGenerator>      MissionGen;                                        // 0x0210(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      DuoMissionGen;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      SquadMissionGen;                                   // 0x0220(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      FiftyFiftyMissionGen;                              // 0x0228(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event1MissionGen;                                  // 0x0230(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event2MissionGen;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event3MissionGen;                                  // 0x0240(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event4MissionGen;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event5MissionGen;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event6MissionGen;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event7MissionGen;                                  // 0x0260(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UFortMissionGenerator>      Event8MissionGen;                                  // 0x0268(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFortAthenaPlaylist                           CurrentPlaylist;                                   // 0x0270(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCurrentSquadFill;                                 // 0x0271(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UWidget*                                SpinnerAndTextContainer;                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          PlayButton;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButton*                          CancelButton;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       MatchmakingHeaderText;                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonTextBlock*                       MatchmakingMessageText;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         PlaylistRotator;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonRotator*                         TeamFillRotator;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHorizontalBox*                         TeamFillRow;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x40];                                     // 0x02B8(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	TArray<EFortAthenaPlaylist> GetActivePlaylists();
	void OnAvailablePlaylistsUpdated();
	void OnCancelButtonPressed();
	void OnChangeTeamFillChanged(bool bFill);
	void OnPlayButtonPressed();
	void OnPlayButtonUpdated(bool bShowPlayButton);
	void OnPlaylistRotatorChanged(int32 PlaylistIndex);
	void RefreshBang();
	void SetCancelButtonState(bool bIsMatchmaking);
	bool SetCurrentPlaylist(EFortAthenaPlaylist NewPlaylist);
	void SetPlayButtonState(bool bCanMatchmake);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortAthenaMatchmakingWidget">();
	}
	static class UFortAthenaMatchmakingWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortAthenaMatchmakingWidget>();
	}
};

// Class FortniteUI.FortHUDElementWidget
// 0x0028 (0x0238 - 0x0210)
class UFortHUDElementWidget : public UCommonUserWidget
{
public:
	struct FGameplayTagContainer                  HUDElementTag;                                     // 0x0210(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_230[0x8];                                      // 0x0230(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleOnHUDElementVisibilityChanged(const struct FGameplayTagContainer& HiddenHUDElementTags);
	void HandleOnHUDResetToDefaults();
	void OnVisibilitySetEvent(ESlateVisibility InVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortHUDElementWidget">();
	}
	static class UFortHUDElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortHUDElementWidget>();
	}
};

// Class FortniteUI.UINavigationManager
// 0x0020 (0x0048 - 0x0028)
class UUINavigationManager : public UObject
{
public:
	UMulticastDelegateProperty_                   OnNavigationEvent;                                 // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FUINavigationEntry>             NavigationStack;                                   // 0x0038(0x0010)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	void ClearStack();
	class FText GetDisplayName(int32 Index_0);
	int32 GetStackSize();
	void NavigationToIndex(int32 Index_0);
	void PopNavigation();
	void PushNavigation(const class FText& DisplayName, class UObject* ObjectData, class FName IdData, int32 IntData, const TDelegate<void(const struct FUINavigationData& Data)>& OnNavigateTo, const TDelegate<void(const struct FUINavigationData& Data)>& OnNavigateFrom);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"UINavigationManager">();
	}
	static class UUINavigationManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUINavigationManager>();
	}
};

// Class FortniteUI.AthenaCompassBase
// 0x0018 (0x0250 - 0x0238)
class UAthenaCompassBase : public UFortHUDElementWidget
{
public:
	class UMaterialInstanceDynamic*               CompassMaterial;                                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UImage*>                         Markers;                                           // 0x0240(0x0010)(BlueprintVisible, ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCompassBase">();
	}
	static class UAthenaCompassBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompassBase>();
	}
};

// Class FortniteUI.FortUIStateTrigger
// 0x0008 (0x0030 - 0x0028)
class UFortUIStateTrigger : public UObject
{
public:
	EFortUIState                                  UIState;                                           // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	bool EvalBP() const;
	bool IsLoggedIn() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger">();
	}
	static class UFortUIStateTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger>();
	}
};

// Class FortniteUI.FortUIStateTrigger_Replay
// 0x0000 (0x0030 - 0x0030)
class UFortUIStateTrigger_Replay final : public UFortUIStateTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger_Replay">();
	}
	static class UFortUIStateTrigger_Replay* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger_Replay>();
	}
};

// Class FortniteUI.FortActivatablePanel
// 0x0028 (0x03E8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortActivatablePanel : public UCommonActivatablePanel
{
public:
	bool                                          bIsPushedOnToContentPanelStack;                    // 0x03C0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsAlreadyOnContentPanelStack;                     // 0x03C1(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputPriority                                InputPriority;                                     // 0x03C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C3[0x25];                                     // 0x03C3(0x0025)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void RestoreCenterWidget(class UWidget* FallbackWidget);
	void RestoreScrollWidget(class UWidget* FallbackWidget);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortActivatablePanel">();
	}
	static class UFortActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortActivatablePanel>();
	}
};
#pragma pack(pop)

// Class FortniteUI.AthenaCompendiumScreenBase
// 0x0018 (0x0400 - 0x03E8)
class UAthenaCompendiumScreenBase final : public UFortActivatablePanel
{
public:
	UMulticastDelegateProperty_                   OnCompendiumChanged;                               // 0x03E8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GetCompendiumBundles(TArray<class UFortCompendiumBundle*>* OutActiveBundles, TArray<class UFortCompendiumBundleDefinition*>* OutUnlockableBundles);
	void GetCompendiumItems(class UFortCompendiumBundle* Bundle, TArray<class UFortCompendiumItem*>* OutActiveItems, TArray<class UFortCompendiumItemDefinition*>* OutUnlockableItems);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCompendiumScreenBase">();
	}
	static class UAthenaCompendiumScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCompendiumScreenBase>();
	}
};

// Class FortniteUI.AthenaCustomizationPicker
// 0x0050 (0x02C8 - 0x0278)
class UAthenaCustomizationPicker : public UFortItemPickerBase
{
public:
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaving;                         // 0x0278(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnCosmeticSelectionSaved;                          // 0x0288(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x10];                                     // 0x0298(0x0010)(Fixing Size After Last Property [ Dumper-8 ])
	EAthenaCustomizationCategory                  CustomizeCategory;                                 // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SubslotIndex;                                      // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCommitingSelection;                               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2B1[0x17];                                     // 0x02B1(0x0017)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void BeginCustomizationCategory(EAthenaCustomizationCategory Category, int32 SubslotToEdit);
	void EndCustomizationCategory();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPicker">();
	}
	static class UAthenaCustomizationPicker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPicker>();
	}
};

// Class FortniteUI.FortUIStateTrigger_InGame
// 0x0000 (0x0030 - 0x0030)
class UFortUIStateTrigger_InGame final : public UFortUIStateTrigger
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortUIStateTrigger_InGame">();
	}
	static class UFortUIStateTrigger_InGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortUIStateTrigger_InGame>();
	}
};

// Class FortniteUI.FortItemPickerButton
// 0x0000 (0x07B0 - 0x07B0)
class UFortItemPickerButton : public UFortItemTileButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemPickerButton">();
	}
	static class UFortItemPickerButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemPickerButton>();
	}
};

// Class FortniteUI.AthenaCustomizationPickerTileButton
// 0x0008 (0x07B8 - 0x07B0)
class UAthenaCustomizationPickerTileButton : public UFortItemPickerButton
{
public:
	uint8                                         Pad_7B0[0x8];                                      // 0x07B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationPickerTileButton">();
	}
	static class UAthenaCustomizationPickerTileButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationPickerTileButton>();
	}
};

// Class FortniteUI.FortItemDetailElementWidget
// 0x0048 (0x0258 - 0x0210)
class UFortItemDetailElementWidget : public UCommonUserWidget
{
public:
	TWeakObjectPtr<class UFortItem>               ItemToDetail;                                      // 0x0210(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               ItemToCompareWith;                                 // 0x0218(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bShouldPreviewUpgradingItem;                       // 0x0220(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class IFortItemViewContextInterface> ItemViewContext;                           // 0x0228(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	EFortItemInspectionMode                       CurrentInspectMode;                                // 0x0238(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_239[0x1F];                                     // 0x0239(0x001F)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleInspectModeChanged();
	void HandleItemToDetailChangedBP();
	void HandlePostDifferentItemToCompareWithSet();
	void HandlePostDifferentItemToDetailSet();
	void HandlePreDifferentItemToCompareWithSet();
	void HandlePreDifferentItemToDetailSet();
	void HandleShouldPreviewUpgradingItemChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemDetailElementWidget">();
	}
	static class UFortItemDetailElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemDetailElementWidget>();
	}
};

// Class FortniteUI.FortSquadSlotItemDetailElementWidget
// 0x0028 (0x0280 - 0x0258)
class UFortSquadSlotItemDetailElementWidget : public UFortItemDetailElementWidget
{
public:
	uint8                                         Pad_258[0x28];                                     // 0x0258(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandlePostDifferentSquadSlotSetBP();
	void SetIdOfSquadSlotToManageBP(const class FName& SquadId, const int32 SquadSlotIndex);

	void GetIdOfSquadSlotToManageBP(class FName* OutSquadId, int32* OutSquadSlotIndex) const;
	class UFortItem* GetItemInSquadSlotBP(const class ULocalPlayer* LocalPlayer) const;
	bool IsSquadSlotLockedBP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotItemDetailElementWidget">();
	}
	static class UFortSquadSlotItemDetailElementWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotItemDetailElementWidget>();
	}
};

// Class FortniteUI.FortSquadSlotSurvivorTraitMatchesDetailWidget
// 0x0028 (0x02A8 - 0x0280)
class UFortSquadSlotSurvivorTraitMatchesDetailWidget : public UFortSquadSlotItemDetailElementWidget
{
public:
	bool                                          IsSquadLeaderSlot;                                 // 0x0280(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          LeaderMatchesSquadType;                            // 0x0281(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_282[0x2];                                      // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SubordinatePersonalityMatchCount;                  // 0x0284(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          MatchesLeaderPersonality;                          // 0x0288(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         MatchingSetBonusCount;                             // 0x028C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SetBonusSize;                                      // 0x0290(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_294[0x14];                                     // 0x0294(0x0014)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleTraitValuesUpdatedBP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortSquadSlotSurvivorTraitMatchesDetailWidget">();
	}
	static class UFortSquadSlotSurvivorTraitMatchesDetailWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortSquadSlotSurvivorTraitMatchesDetailWidget>();
	}
};

// Class FortniteUI.AthenaCustomizationScreenBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaCustomizationScreenBase : public UFortActivatablePanel
{
public:
	class UAthenaCustomizationPicker*             SelectionPicker;                                   // 0x03E8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static bool CanShowSlotType(EAthenaCustomizationCategory SlotType);

	class UFortItem* GetFavoriteItemForCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationScreenBase">();
	}
	static class UAthenaCustomizationScreenBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationScreenBase>();
	}
};

// Class FortniteUI.AthenaCustomizationSlotSelectorButton
// 0x0018 (0x0798 - 0x0780)
class UAthenaCustomizationSlotSelectorButton : public UCommonButton
{
public:
	EAthenaCustomizationCategory                  CustomizationType;                                 // 0x0780(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         SubslotIndex;                                      // 0x0784(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_790[0x8];                                      // 0x0790(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetCustomizationType(EAthenaCustomizationCategory NewType, int32 InSubslotIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaCustomizationSlotSelectorButton">();
	}
	static class UAthenaCustomizationSlotSelectorButton* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaCustomizationSlotSelectorButton>();
	}
};

// Class FortniteUI.AthenaEventGamesBase
// 0x0008 (0x03F0 - 0x03E8)
class UAthenaEventGamesBase final : public UFortActivatablePanel
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaEventGamesBase">();
	}
	static class UAthenaEventGamesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaEventGamesBase>();
	}
};

// Class FortniteUI.FortItemDetailsActivatablePanel
// 0x0038 (0x03F8 - 0x03C0)
#pragma pack(push, 0x1)
class alignas(0x08) UFortItemDetailsActivatablePanel : public UCommonActivatablePanel
{
public:
	TWeakObjectPtr<class UFortItem>               ItemToDetail;                                      // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItem>               ItemToCompareWith;                                 // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UFortItemManagementScreen> HostItemManagementScreen;                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D8[0x20];                                     // 0x03D8(0x0020)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleConsumeItemProgressChangedBP();
	void HandleDifferentItemToCompareSetBP();
	void HandleDifferentItemToDetailSetBP();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemDetailsActivatablePanel">();
	}
	static class UFortItemDetailsActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemDetailsActivatablePanel>();
	}
};
#pragma pack(pop)

// Class FortniteUI.FortItemMulchModeActivatablePanel
// 0x0018 (0x0410 - 0x03F8)
class UFortItemMulchModeActivatablePanel : public UFortItemDetailsActivatablePanel
{
public:
	class UFortItemManagementItemDetailsPanel*    MulchModeItemDetailsPanel;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFortItemManagementMulchDetailsPanel*   MulchDetailsPanel;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemMulchModeActivatablePanel">();
	}
	static class UFortItemMulchModeActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemMulchModeActivatablePanel>();
	}
};

// Class FortniteUI.AthenaGamePhaseWidgetBase
// 0x0010 (0x0248 - 0x0238)
class UAthenaGamePhaseWidgetBase : public UFortHUDElementWidget
{
public:
	class UTextBlock*                             TimeText;                                          // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_240[0x8];                                      // 0x0240(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);
	void OnGamePhaseStepChanged(EAthenaGamePhaseStep GamePhaseStep);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaGamePhaseWidgetBase">();
	}
	static class UAthenaGamePhaseWidgetBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaGamePhaseWidgetBase>();
	}
};

// Class FortniteUI.FortExpeditionPickVehicleWidget
// 0x0010 (0x03D0 - 0x03C0)
class UFortExpeditionPickVehicleWidget : public UCommonActivatablePanel
{
public:
	TWeakObjectPtr<class UFortExpeditionItem>     Item;                                              // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3C8[0x8];                                      // 0x03C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetData(class UFortExpeditionItem* InItem);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExpeditionPickVehicleWidget">();
	}
	static class UFortExpeditionPickVehicleWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortExpeditionPickVehicleWidget>();
	}
};

// Class FortniteUI.AthenaHUDBase
// 0x0000 (0x03E0 - 0x03E0)
class UAthenaHUDBase : public UFortUIStateWidget_NUI
{
public:
	void SquadMembersChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDBase">();
	}
	static class UAthenaHUDBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDBase>();
	}
};

// Class FortniteUI.AthenaHUDContext
// 0x0180 (0x01A8 - 0x0028)
class UAthenaHUDContext final : public UBlueprintContextBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	UMulticastDelegateProperty_                   OnLocalPlayerWon;                                  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalTeamWon;                                    // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerKilledPlayer;                         // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerDBNOStateChanged;                     // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnUIGameplayCue;                                   // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetHealthChanged;                         // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetShieldChanged;                         // 0x0090(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnViewTargetDBNOChanged;                           // 0x00A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnLocalPlayerBeginSkydiving;                       // 0x00B0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberAdded;                                // 0x00C0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberRemoved;                              // 0x00D0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadHitPointFractionsChanged;                   // 0x00E0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberDBNOChanged;                          // 0x00F0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberRevivingChanged;                      // 0x0100(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberDeadChanged;                          // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberPlayerNamesChanged;                   // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberTalkingChanged;                       // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberMutedChanged;                         // 0x0140(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnSquadMemberKillsChanged;                         // 0x0150(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventoryItemSelected;                           // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventorySwapStarted;                            // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnInventorySwapComplete;                           // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bPendingAttachToHUD;                               // 0x0190(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	TWeakObjectPtr<class UFortItem>               LastSelectedInventoryItem;                         // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19C[0xC];                                      // 0x019C(0x000C)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void CancelSwap();
	void HandleLocalPlayerBeginSkydiving();
	void HandleLocalPlayerDBNOStateChanged(bool bIsDBNO);
	void HandleUIGameplayCue(class FName CueName, EGameplayCueEvent EventType, const struct FGameplayCueParameters& Parameters);
	void SetSelectedInventoryItem(class UFortItem* Item);
	void StartOrFinishSwap(int32 SlotIndex);

	class UFortItem* GetSelectedInventoryItem() const;
	bool IsSwapping() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDContext">();
	}
	static class UAthenaHUDContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDContext>();
	}
};

// Class FortniteUI.FortItemDisplayNameText
// 0x0030 (0x02A0 - 0x0270)
class UFortItemDisplayNameText final : public UCommonTextBlock
{
public:
	TWeakObjectPtr<class UFortItem>               ItemToRepresent;                                   // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x28];                                     // 0x0278(0x0028)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void SetItemToRepresent(class UFortItem* ItemToRepresent_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemDisplayNameText">();
	}
	static class UFortItemDisplayNameText* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemDisplayNameText>();
	}
};

// Class FortniteUI.AthenaHUDGamePhaseChangingBase
// 0x0008 (0x0240 - 0x0238)
class UAthenaHUDGamePhaseChangingBase : public UFortHUDElementWidget
{
public:
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void GamePhaseStepChanged(EAthenaGamePhaseStep Step);
	void HandleGamePhaseStepChanged(EAthenaGamePhaseStep Step);
	void UpdateMessaging(EAthenaGamePhaseStep Step, const class FText& MESSAGE, const class FText& TimeText);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDGamePhaseChangingBase">();
	}
	static class UAthenaHUDGamePhaseChangingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDGamePhaseChangingBase>();
	}
};

// Class FortniteUI.AthenaHUDPlayerActionAlertBase
// 0x0020 (0x0258 - 0x0238)
class UAthenaHUDPlayerActionAlertBase : public UFortHUDElementWidget
{
public:
	class AFortPlayerPawnAthena*                  LastPlayerPawn;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bReadyForNextAlert;                                // 0x0240(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_241[0x17];                                     // 0x0241(0x0017)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AlertPlayer(EAthenaPlayerActionAlert Alert, const class FText& DetailText);
	void RequestNextAlert();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDPlayerActionAlertBase">();
	}
	static class UAthenaHUDPlayerActionAlertBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDPlayerActionAlertBase>();
	}
};

// Class FortniteUI.FortItemDetailsModeActivatablePanel
// 0x0018 (0x0410 - 0x03F8)
class UFortItemDetailsModeActivatablePanel : public UFortItemDetailsActivatablePanel
{
public:
	class UCommonWidgetSwitcher*                  DetailPanelWidgetSwitcher;                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_400[0x10];                                     // 0x0400(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void HandleOnActiveWidgetChanged(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortItemDetailsModeActivatablePanel">();
	}
	static class UFortItemDetailsModeActivatablePanel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortItemDetailsModeActivatablePanel>();
	}
};

// Class FortniteUI.AthenaHUDTeamIndicatorBase
// 0x0010 (0x0110 - 0x0100)
class UAthenaHUDTeamIndicatorBase final : public UWidget
{
public:
	uint8                                         Pad_100[0x10];                                     // 0x0100(0x0010)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaHUDTeamIndicatorBase">();
	}
	static class UAthenaHUDTeamIndicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaHUDTeamIndicatorBase>();
	}
};

// Class FortniteUI.AthenaInventoryEquipButtonBase
// 0x0018 (0x0798 - 0x0780)
class UAthenaInventoryEquipButtonBase : public UCommonButton
{
public:
	class UFortMultiSizeItemCard*                 ItemWidget;                                        // 0x0780(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidget*                                EmptyImage;                                        // 0x0788(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         SlotIndex;                                         // 0x0790(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryEquipButtonBase">();
	}
	static class UAthenaInventoryEquipButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryEquipButtonBase>();
	}
};

// Class FortniteUI.FortExpeditionMasterWidget
// 0x0080 (0x0440 - 0x03C0)
class UFortExpeditionMasterWidget : public UCommonActivatablePanel
{
public:
	uint8                                         Pad_3C0[0x80];                                     // 0x03C0(0x0080)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FortExpeditionMasterWidget">();
	}
	static class UFortExpeditionMasterWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFortExpeditionMasterWidget>();
	}
};

// Class FortniteUI.AthenaInventoryFortItemTileButtonBase
// 0x0000 (0x07B0 - 0x07B0)
class UAthenaInventoryFortItemTileButtonBase : public UFortItemTileButton
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AthenaInventoryFortItemTileButtonBase">();
	}
	static class UAthenaInventoryFortItemTileButtonBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaInventoryFortItemTileButtonBase>();
	}
};

// Class FortniteUI.AthenaInventoryPanelBase
// 0x0058 (0x0440 - 0x03E8)
class UAthenaInventoryPanelBase : public UFortActivatablePanel
{
public:
	class UFortItemTileView*                      ResourceView;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFortItemTileView*                      AmmoView;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCommonButtonGroup*                     EquipButtonGroup;                                  // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_400[0x40];                                     // 0x0400(0x0040)(Fixing Struct Size After Last Property [ Dumper-8 ])

public:
	void AdvanceSelection(class UFortItemTileView* TileView);
	void AttemptToUpdateFocus();
	void FocusTileView(class UFortItemTileView* TileView);
	class UFortItemTileView* GetTileViewForItem(class UFortItem* Item);
	void HandleCursorModeChanged(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleCursorModeChangedBP(bool bCursorModeEnabled, class FName ActionName, class UUserWidget* CursorModeContentWidget);
	void HandleInventoryItemClicked(class UObject* Item);
