#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GamepadMappingInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GamepadMappingInfo.GamepadMappingInfo_C.Update Displayed Mapping
// 0x00D0 (0x00D0 - 0x0000)
struct GamepadMappingInfo_C_Update_Displayed_Mapping final
{
public:
	int32                                         platform;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mode;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Configuration;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             T_Mode_Combat;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_Mode_Build;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_PS4_Lines;                                       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_XboxOne_Lines;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_PS4;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             T_XboxOne;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Temp_int_Variable;                                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Temp_int_Variable2;                                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Temp_int_Variable3;                                // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0070(0x0018)()
	int32                                         Temp_int_Variable4;                                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0090(0x0018)()
	int32                                         Temp_int_Variable5;                                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable6;                                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select3_Default;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select4_Default;                            // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UTexture2D*                             K2Node_Select5_Default;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select6_Default;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.OnConfigChanged
// 0x0018 (0x0018 - 0x0000)
struct GamepadMappingInfo_C_OnConfigChanged final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged_Athena
// 0x1580 (0x1580 - 0x0000)
struct GamepadMappingInfo_C_HandleConfigChanged_Athena final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0028(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Temp_int_Variable2;                                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable3;                               // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable5;                               // 0x0098(0x0018)()
	int32                                         Temp_int_Variable3;                                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select2_Default;                            // 0x00B8(0x0018)()
	class FText                                   Temp_text_Variable6;                               // 0x00D0(0x0018)()
	class FText                                   Temp_text_Variable7;                               // 0x00E8(0x0018)()
	class FText                                   Temp_text_Variable8;                               // 0x0100(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select3_Default;                            // 0x0120(0x0018)()
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable5;                               // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable6;                               // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable4;                               // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable7;                               // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable8;                               // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable5;                               // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable9;                               // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable10;                              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         Temp_int_Variable4;                                // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable9;                               // 0x0148(0x0018)()
	class FText                                   Temp_text_Variable10;                              // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable11;                              // 0x0178(0x0018)()
	int32                                         Temp_int_Variable5;                                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select4_Default;                            // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable12;                              // 0x01B0(0x0018)()
	class FText                                   Temp_text_Variable13;                              // 0x01C8(0x0018)()
	class FText                                   Temp_text_Variable14;                              // 0x01E0(0x0018)()
	int32                                         Temp_int_Variable6;                                // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select5_Default;                            // 0x0200(0x0018)()
	class FText                                   Temp_text_Variable15;                              // 0x0218(0x0018)()
	class FText                                   Temp_text_Variable16;                              // 0x0230(0x0018)()
	class FText                                   Temp_text_Variable17;                              // 0x0248(0x0018)()
	int32                                         Temp_int_Variable7;                                // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select6_Default;                            // 0x0268(0x0018)()
	class FText                                   Temp_text_Variable18;                              // 0x0280(0x0018)()
	class FText                                   Temp_text_Variable19;                              // 0x0298(0x0018)()
	class FText                                   Temp_text_Variable20;                              // 0x02B0(0x0018)()
	int32                                         Temp_int_Variable8;                                // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select7_Default;                            // 0x02D0(0x0018)()
	class FText                                   Temp_text_Variable21;                              // 0x02E8(0x0018)()
	class FText                                   Temp_text_Variable22;                              // 0x0300(0x0018)()
	class FText                                   Temp_text_Variable23;                              // 0x0318(0x0018)()
	int32                                         Temp_int_Variable9;                                // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select8_Default;                            // 0x0338(0x0018)()
	class FText                                   Temp_text_Variable24;                              // 0x0350(0x0018)()
	class FText                                   Temp_text_Variable25;                              // 0x0368(0x0018)()
	class FText                                   Temp_text_Variable26;                              // 0x0380(0x0018)()
	int32                                         Temp_int_Variable10;                               // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select9_Default;                            // 0x03A0(0x0018)()
	class FText                                   Temp_text_Variable27;                              // 0x03B8(0x0018)()
	class FText                                   Temp_text_Variable28;                              // 0x03D0(0x0018)()
	class FText                                   Temp_text_Variable29;                              // 0x03E8(0x0018)()
	int32                                         Temp_int_Variable11;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select10_Default;                           // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable30;                              // 0x0420(0x0018)()
	class FText                                   Temp_text_Variable31;                              // 0x0438(0x0018)()
	class FText                                   Temp_text_Variable32;                              // 0x0450(0x0018)()
	int32                                         Temp_int_Variable12;                               // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select11_Default;                           // 0x0470(0x0018)()
	class FText                                   Temp_text_Variable33;                              // 0x0488(0x0018)()
	class FText                                   Temp_text_Variable34;                              // 0x04A0(0x0018)()
	class FText                                   Temp_text_Variable35;                              // 0x04B8(0x0018)()
	int32                                         Temp_int_Variable13;                               // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select12_Default;                           // 0x04D8(0x0018)()
	class FText                                   Temp_text_Variable36;                              // 0x04F0(0x0018)()
	class FText                                   Temp_text_Variable37;                              // 0x0508(0x0018)()
	class FText                                   Temp_text_Variable38;                              // 0x0520(0x0018)()
	int32                                         Temp_int_Variable14;                               // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select13_Default;                           // 0x0540(0x0018)()
	class FText                                   Temp_text_Variable39;                              // 0x0558(0x0018)()
	class FText                                   Temp_text_Variable40;                              // 0x0570(0x0018)()
	class FText                                   Temp_text_Variable41;                              // 0x0588(0x0018)()
	int32                                         Temp_int_Variable15;                               // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select14_Default;                           // 0x05A8(0x0018)()
	class FText                                   Temp_text_Variable42;                              // 0x05C0(0x0018)()
	class FText                                   Temp_text_Variable43;                              // 0x05D8(0x0018)()
	class FText                                   Temp_text_Variable44;                              // 0x05F0(0x0018)()
	int32                                         Temp_int_Variable16;                               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select15_Default;                           // 0x0610(0x0018)()
	class FText                                   Temp_text_Variable45;                              // 0x0628(0x0018)()
	class FText                                   Temp_text_Variable46;                              // 0x0640(0x0018)()
	class FText                                   Temp_text_Variable47;                              // 0x0658(0x0018)()
	int32                                         Temp_int_Variable17;                               // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_674[0x4];                                      // 0x0674(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select16_Default;                           // 0x0678(0x0018)()
	class FText                                   Temp_text_Variable48;                              // 0x0690(0x0018)()
	class FText                                   Temp_text_Variable49;                              // 0x06A8(0x0018)()
	class FText                                   Temp_text_Variable50;                              // 0x06C0(0x0018)()
	int32                                         Temp_int_Variable18;                               // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select17_Default;                           // 0x06E0(0x0018)()
	class FText                                   Temp_text_Variable51;                              // 0x06F8(0x0018)()
	class FText                                   Temp_text_Variable52;                              // 0x0710(0x0018)()
	class FText                                   Temp_text_Variable53;                              // 0x0728(0x0018)()
	int32                                         Temp_int_Variable19;                               // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select18_Default;                           // 0x0748(0x0018)()
	class FText                                   Temp_text_Variable54;                              // 0x0760(0x0018)()
	class FText                                   Temp_text_Variable55;                              // 0x0778(0x0018)()
	class FText                                   Temp_text_Variable56;                              // 0x0790(0x0018)()
	int32                                         Temp_int_Variable20;                               // 0x07A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7AC[0x4];                                      // 0x07AC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select19_Default;                           // 0x07B0(0x0018)()
	class FText                                   Temp_text_Variable57;                              // 0x07C8(0x0018)()
	class FText                                   Temp_text_Variable58;                              // 0x07E0(0x0018)()
	class FText                                   Temp_text_Variable59;                              // 0x07F8(0x0018)()
	int32                                         Temp_int_Variable21;                               // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_814[0x4];                                      // 0x0814(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select20_Default;                           // 0x0818(0x0018)()
	class FText                                   Temp_text_Variable60;                              // 0x0830(0x0018)()
	class FText                                   Temp_text_Variable61;                              // 0x0848(0x0018)()
	class FText                                   Temp_text_Variable62;                              // 0x0860(0x0018)()
	int32                                         Temp_int_Variable22;                               // 0x0878(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select21_Default;                           // 0x0880(0x0018)()
	class FText                                   Temp_text_Variable63;                              // 0x0898(0x0018)()
	class FText                                   Temp_text_Variable64;                              // 0x08B0(0x0018)()
	class FText                                   Temp_text_Variable65;                              // 0x08C8(0x0018)()
	int32                                         Temp_int_Variable23;                               // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8E4[0x4];                                      // 0x08E4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select22_Default;                           // 0x08E8(0x0018)()
	class FText                                   Temp_text_Variable66;                              // 0x0900(0x0018)()
	class FText                                   Temp_text_Variable67;                              // 0x0918(0x0018)()
	class FText                                   Temp_text_Variable68;                              // 0x0930(0x0018)()
	int32                                         Temp_int_Variable24;                               // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select23_Default;                           // 0x0950(0x0018)()
	class FText                                   Temp_text_Variable69;                              // 0x0968(0x0018)()
	class FText                                   Temp_text_Variable70;                              // 0x0980(0x0018)()
	class FText                                   Temp_text_Variable71;                              // 0x0998(0x0018)()
	int32                                         Temp_int_Variable25;                               // 0x09B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B4[0x4];                                      // 0x09B4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select24_Default;                           // 0x09B8(0x0018)()
	class FText                                   Temp_text_Variable72;                              // 0x09D0(0x0018)()
	class FText                                   Temp_text_Variable73;                              // 0x09E8(0x0018)()
	class FText                                   Temp_text_Variable74;                              // 0x0A00(0x0018)()
	int32                                         Temp_int_Variable26;                               // 0x0A18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1C[0x4];                                      // 0x0A1C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select25_Default;                           // 0x0A20(0x0018)()
	class FText                                   Temp_text_Variable75;                              // 0x0A38(0x0018)()
	class FText                                   Temp_text_Variable76;                              // 0x0A50(0x0018)()
	class FText                                   Temp_text_Variable77;                              // 0x0A68(0x0018)()
	int32                                         Temp_int_Variable27;                               // 0x0A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A84[0x4];                                      // 0x0A84(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select26_Default;                           // 0x0A88(0x0018)()
	class FText                                   Temp_text_Variable78;                              // 0x0AA0(0x0018)()
	class FText                                   Temp_text_Variable79;                              // 0x0AB8(0x0018)()
	class FText                                   Temp_text_Variable80;                              // 0x0AD0(0x0018)()
	int32                                         Temp_int_Variable28;                               // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select27_Default;                           // 0x0AF0(0x0018)()
	class FText                                   Temp_text_Variable81;                              // 0x0B08(0x0018)()
	class FText                                   Temp_text_Variable82;                              // 0x0B20(0x0018)()
	class FText                                   Temp_text_Variable83;                              // 0x0B38(0x0018)()
	int32                                         Temp_int_Variable29;                               // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select28_Default;                           // 0x0B58(0x0018)()
	class FText                                   Temp_text_Variable84;                              // 0x0B70(0x0018)()
	class FText                                   Temp_text_Variable85;                              // 0x0B88(0x0018)()
	int32                                         Temp_int_Variable30;                               // 0x0BA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA4[0x4];                                      // 0x0BA4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select29_Default;                           // 0x0BA8(0x0018)()
	class FText                                   Temp_text_Variable86;                              // 0x0BC0(0x0018)()
	class FText                                   Temp_text_Variable87;                              // 0x0BD8(0x0018)()
	class FText                                   Temp_text_Variable88;                              // 0x0BF0(0x0018)()
	int32                                         Temp_int_Variable31;                               // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0C[0x4];                                      // 0x0C0C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select30_Default;                           // 0x0C10(0x0018)()
	class FText                                   Temp_text_Variable89;                              // 0x0C28(0x0018)()
	class FText                                   Temp_text_Variable90;                              // 0x0C40(0x0018)()
	class FText                                   Temp_text_Variable91;                              // 0x0C58(0x0018)()
	int32                                         Temp_int_Variable32;                               // 0x0C70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C74[0x4];                                      // 0x0C74(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select31_Default;                           // 0x0C78(0x0018)()
	class FText                                   Temp_text_Variable92;                              // 0x0C90(0x0018)()
	class FText                                   Temp_text_Variable93;                              // 0x0CA8(0x0018)()
	class FText                                   Temp_text_Variable94;                              // 0x0CC0(0x0018)()
	int32                                         Temp_int_Variable33;                               // 0x0CD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CDC[0x4];                                      // 0x0CDC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select32_Default;                           // 0x0CE0(0x0018)()
	class FText                                   Temp_text_Variable95;                              // 0x0CF8(0x0018)()
	class FText                                   Temp_text_Variable96;                              // 0x0D10(0x0018)()
	class FText                                   Temp_text_Variable97;                              // 0x0D28(0x0018)()
	int32                                         Temp_int_Variable34;                               // 0x0D40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D44[0x4];                                      // 0x0D44(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select33_Default;                           // 0x0D48(0x0018)()
	class FText                                   Temp_text_Variable98;                              // 0x0D60(0x0018)()
	class FText                                   Temp_text_Variable99;                              // 0x0D78(0x0018)()
	class FText                                   Temp_text_Variable100;                             // 0x0D90(0x0018)()
	int32                                         Temp_int_Variable35;                               // 0x0DA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAC[0x4];                                      // 0x0DAC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select34_Default;                           // 0x0DB0(0x0018)()
	class FText                                   Temp_text_Variable101;                             // 0x0DC8(0x0018)()
	class FText                                   Temp_text_Variable102;                             // 0x0DE0(0x0018)()
	class FText                                   Temp_text_Variable103;                             // 0x0DF8(0x0018)()
	int32                                         Temp_int_Variable36;                               // 0x0E10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E14[0x4];                                      // 0x0E14(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select35_Default;                           // 0x0E18(0x0018)()
	class FText                                   Temp_text_Variable104;                             // 0x0E30(0x0018)()
	class FText                                   Temp_text_Variable105;                             // 0x0E48(0x0018)()
	class FText                                   Temp_text_Variable106;                             // 0x0E60(0x0018)()
	int32                                         Temp_int_Variable37;                               // 0x0E78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E7C[0x4];                                      // 0x0E7C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select36_Default;                           // 0x0E80(0x0018)()
	class FText                                   Temp_text_Variable107;                             // 0x0E98(0x0018)()
	class FText                                   Temp_text_Variable108;                             // 0x0EB0(0x0018)()
	class FText                                   Temp_text_Variable109;                             // 0x0EC8(0x0018)()
	int32                                         Temp_int_Variable38;                               // 0x0EE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE4[0x4];                                      // 0x0EE4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select37_Default;                           // 0x0EE8(0x0018)()
	class FText                                   Temp_text_Variable110;                             // 0x0F00(0x0018)()
	class FText                                   Temp_text_Variable111;                             // 0x0F18(0x0018)()
	class FText                                   Temp_text_Variable112;                             // 0x0F30(0x0018)()
	int32                                         Temp_int_Variable39;                               // 0x0F48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4C[0x4];                                      // 0x0F4C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select38_Default;                           // 0x0F50(0x0018)()
	class FText                                   Temp_text_Variable113;                             // 0x0F68(0x0018)()
	class FText                                   Temp_text_Variable114;                             // 0x0F80(0x0018)()
	class FText                                   Temp_text_Variable115;                             // 0x0F98(0x0018)()
	int32                                         Temp_int_Variable40;                               // 0x0FB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB4[0x4];                                      // 0x0FB4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select39_Default;                           // 0x0FB8(0x0018)()
	class FText                                   Temp_text_Variable116;                             // 0x0FD0(0x0018)()
	class FText                                   Temp_text_Variable117;                             // 0x0FE8(0x0018)()
	class FText                                   Temp_text_Variable118;                             // 0x1000(0x0018)()
	int32                                         Temp_int_Variable41;                               // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101C[0x4];                                     // 0x101C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select40_Default;                           // 0x1020(0x0018)()
	class FText                                   Temp_text_Variable119;                             // 0x1038(0x0018)()
	class FText                                   Temp_text_Variable120;                             // 0x1050(0x0018)()
	class FText                                   Temp_text_Variable121;                             // 0x1068(0x0018)()
	int32                                         Temp_int_Variable42;                               // 0x1080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1084[0x4];                                     // 0x1084(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select41_Default;                           // 0x1088(0x0018)()
	class FText                                   Temp_text_Variable122;                             // 0x10A0(0x0018)()
	class FText                                   Temp_text_Variable123;                             // 0x10B8(0x0018)()
	class FText                                   Temp_text_Variable124;                             // 0x10D0(0x0018)()
	int32                                         Temp_int_Variable43;                               // 0x10E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10EC[0x4];                                     // 0x10EC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select42_Default;                           // 0x10F0(0x0018)()
	class FText                                   Temp_text_Variable125;                             // 0x1108(0x0018)()
	class FText                                   Temp_text_Variable126;                             // 0x1120(0x0018)()
	class FText                                   Temp_text_Variable127;                             // 0x1138(0x0018)()
	int32                                         Temp_int_Variable44;                               // 0x1150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1154[0x4];                                     // 0x1154(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select43_Default;                           // 0x1158(0x0018)()
	class FText                                   Temp_text_Variable128;                             // 0x1170(0x0018)()
	class FText                                   Temp_text_Variable129;                             // 0x1188(0x0018)()
	class FText                                   Temp_text_Variable130;                             // 0x11A0(0x0018)()
	int32                                         Temp_int_Variable45;                               // 0x11B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11BC[0x4];                                     // 0x11BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select44_Default;                           // 0x11C0(0x0018)()
	class FText                                   Temp_text_Variable131;                             // 0x11D8(0x0018)()
	class FText                                   Temp_text_Variable132;                             // 0x11F0(0x0018)()
	class FText                                   Temp_text_Variable133;                             // 0x1208(0x0018)()
	int32                                         Temp_int_Variable46;                               // 0x1220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1224[0x4];                                     // 0x1224(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select45_Default;                           // 0x1228(0x0018)()
	class FText                                   Temp_text_Variable134;                             // 0x1240(0x0018)()
	class FText                                   Temp_text_Variable135;                             // 0x1258(0x0018)()
	class FText                                   Temp_text_Variable136;                             // 0x1270(0x0018)()
	int32                                         Temp_int_Variable47;                               // 0x1288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_128C[0x4];                                     // 0x128C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select46_Default;                           // 0x1290(0x0018)()
	class FText                                   Temp_text_Variable137;                             // 0x12A8(0x0018)()
	class FText                                   Temp_text_Variable138;                             // 0x12C0(0x0018)()
	class FText                                   Temp_text_Variable139;                             // 0x12D8(0x0018)()
	int32                                         Temp_int_Variable48;                               // 0x12F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12F4[0x4];                                     // 0x12F4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select47_Default;                           // 0x12F8(0x0018)()
	class FText                                   Temp_text_Variable140;                             // 0x1310(0x0018)()
	class FText                                   Temp_text_Variable141;                             // 0x1328(0x0018)()
	class FText                                   Temp_text_Variable142;                             // 0x1340(0x0018)()
	int32                                         Temp_int_Variable49;                               // 0x1358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135C[0x4];                                     // 0x135C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select48_Default;                           // 0x1360(0x0018)()
	class FText                                   Temp_text_Variable143;                             // 0x1378(0x0018)()
	class FText                                   Temp_text_Variable144;                             // 0x1390(0x0018)()
	class FText                                   Temp_text_Variable145;                             // 0x13A8(0x0018)()
	int32                                         Temp_int_Variable50;                               // 0x13C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C4[0x4];                                     // 0x13C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select49_Default;                           // 0x13C8(0x0018)()
	class FText                                   Temp_text_Variable146;                             // 0x13E0(0x0018)()
	class FText                                   Temp_text_Variable147;                             // 0x13F8(0x0018)()
	class FText                                   Temp_text_Variable148;                             // 0x1410(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x1428(0x0018)()
	class FText                                   K2Node_Select50_Default;                           // 0x1440(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x1458(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x1470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1471[0x7];                                     // 0x1471(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x1478(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue2;                     // 0x1490(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue2;         // 0x14A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select51_Default;                           // 0x14A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14AA[0x6];                                     // 0x14AA(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x14B0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue4;             // 0x14C8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue5;             // 0x14E0(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue6;             // 0x14F8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue3;                     // 0x1510(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue4;                     // 0x1528(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue3;         // 0x1540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue4;         // 0x1541(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select52_Default;                           // 0x1542(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select53_Default;                           // 0x1543(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1544[0x4];                                     // 0x1544(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   CallFunc_GetText_ReturnValue5;                     // 0x1548(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue6;                     // 0x1560(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue5;         // 0x1578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue6;         // 0x1579(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select54_Default;                           // 0x157A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select55_Default;                           // 0x157B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable11;                              // 0x157C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable12;                              // 0x157D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable6;                               // 0x157E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select56_Default;                           // 0x157F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function GamepadMappingInfo.GamepadMappingInfo_C.HandleConfigChanged
// 0x10C0 (0x10C0 - 0x0000)
struct GamepadMappingInfo_C_HandleConfigChanged final
{
public:
	int32                                         Mode;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Config;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable2;                               // 0x0028(0x0018)()
	int32                                         Temp_int_Variable2;                                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable3;                               // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable4;                               // 0x0078(0x0018)()
	bool                                          Temp_bool_Variable2;                               // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select2_Default;                            // 0x0098(0x0018)()
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable3;                               // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
