#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HealthWarningWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HealthWarningWidget.HealthWarningWidget_C
// 0x0058 (0x0428 - 0x03D0)
class UHealthWarningWidget_C final : public UFortHealthWarningBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       FinishingAnim;                                     // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_0;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HealthWarningText;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RatingIconsBox;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   HealthWarningCompleted;                            // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ShowTimeLength;                                    // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           ShowTimer;                                         // 0x0410(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMargin                                IconPadding;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_HealthWarningWidget(int32 EntryPoint);
	void AddIconToScreen(class UCommonLazyImage* Image);
	void Construct();
	void Destruct();
	void HandleShowTimerComplete();
	void OnActivated();
	void SetupShowTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HealthWarningWidget_C">();
	}
	static class UHealthWarningWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHealthWarningWidget_C>();
	}
};

}

