#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LegacyRatingWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LegacyRatingWidget.LegacyRatingWidget_C
// 0x1278 (0x19D8 - 0x0760)
class ULegacyRatingWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                Border_Base;                                       // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortNumericTextBlock*                  NumericText_RatingValue;                           // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RatingValue;                                       // 0x0788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x0790(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         InterpDuration;                                    // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Silhouette;                                 // 0x07C0(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Chamfer;                                    // 0x0A90(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Shadow;                                     // 0x0D60(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Icon;                                       // 0x1030(0x02D0)(Edit, BlueprintVisible)
	bool                                          OverrideDefaultColor;                              // 0x1300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1301[0x3];                                     // 0x1301(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLinearColor                           Color_Light;                                       // 0x1304(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Medium;                                      // 0x1314(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Dark;                                        // 0x1324(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Light;                               // 0x1334(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Medium;                              // 0x1344(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Dark;                                // 0x1354(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1364[0x4];                                     // 0x1364(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Icon_Alt;                                   // 0x1368(0x02D0)(Edit, BlueprintVisible)
	bool                                          UseAlternateIcon;                                  // 0x1638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_1639[0x7];                                     // 0x1639(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Shadow_Alt;                                 // 0x1640(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeMargin                   MMargin_Alt;                                       // 0x1910(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FFortMultiSizeMargin                   MMargin;                                           // 0x1970(0x0060)(Edit, BlueprintVisible, NoDestructor)
	bool                                          ShowTeamPowerRating;                               // 0x19D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LegacyRatingWidget(int32 EntryPoint);
	void PlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void Construct();
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId_0);
	void PreConstruct(bool IsDesignTime);
	void Update_Rating_Value(int32 Rating);
	void Set_Size_Box();
	void Set_Padding();
	void Update();
	void Set_Unique_ID(const struct FUniqueNetIdRepl& ID);
	void Update_From_Unique_ID();
	void Update_Base_Material();
	void Set_Texture2D_Parameter_From_Multi_Size_Brush(class UMaterialInstanceDynamic* Mid, class FName Parameter, const struct FFortMultiSizeBrush& MBrush);
	void Override_Default_Color_Set(bool Override, const struct FLinearColor& Light_Color, const struct FLinearColor& Medium_Color, const struct FLinearColor& Dark_Color);
	void SetShouldShowTeamPowerRating(bool ShowTeamRating);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LegacyRatingWidget_C">();
	}
	static class ULegacyRatingWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULegacyRatingWidget_C>();
	}
};

}

