#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MissionRewardItem_Tooltip

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MissionRewardItem-Tooltip.MissionRewardItem-Tooltip_C
// 0x0038 (0x0240 - 0x0208)
class UMissionRewardItem_Tooltip_C final : public UUserWidget
{
public:
	class UBorder*                                Border;                                            // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextField;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              Item;                                              // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x0228(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	class FText Get_Reward_Name();
	struct FSlateBrush Get_Reward_Icon();
	struct FLinearColor Get_Rarity_Color();
	struct FSlateColor Get_Rarity_Color__SlateColor_();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MissionRewardItem-Tooltip_C">();
	}
	static class UMissionRewardItem_Tooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMissionRewardItem_Tooltip_C>();
	}
};

}

