#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: NodeBackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SkillTreeGroups_structs.hpp"
#include "SkillTreeGroupColors_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass NodeBackground.NodeBackground_C
// 0x0078 (0x07F8 - 0x0780)
class UNodeBackground_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0780(0x0008)(Transient, DuplicateTransient)
	ESkillTreeGroups                              Group;                                             // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSkillTreeGroupColors                  GroupColors;                                       // 0x078C(0x0054)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Horizontal;                                        // 0x07E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UClass*                                 VerticalStyle;                                     // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HorizontalStyle;                                   // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NodeBackground(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetBackgroundColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NodeBackground_C">();
	}
	static class UNodeBackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNodeBackground_C>();
	}
};

}

