#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: PlayerChoiceButtonWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PlayerChoiceButtonWidget.PlayerChoiceButtonWidget_C
// 0x0020 (0x0780 - 0x0760)
class UPlayerChoiceButtonWidget_C final : public UFortBaseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0760(0x0008)(Transient, DuplicateTransient)
	class ULegacyButtonIconText_C*                Button;                                            // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ChoiceID;                                          // 0x0770(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UPlayerChoiceWidget_C*                  Owner;                                             // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_98_FortBaseButtonClicked__DelegateSignature(class UFortBaseButton* Button_0);
	void ConfigureChoice(const struct FChoiceDataEntry& Choice, int32 ChoiceID_0, class UPlayerChoiceWidget_C* Owner_0);
	void ExecuteUbergraph_PlayerChoiceButtonWidget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlayerChoiceButtonWidget_C">();
	}
	static class UPlayerChoiceButtonWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlayerChoiceButtonWidget_C>();
	}
};

}

