#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: RatingWidget_NUI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RatingWidget_NUI.RatingWidget_NUI_C
// 0x1278 (0x1488 - 0x0210)
class URatingWidget_NUI_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(Transient, DuplicateTransient)
	class UCommonNumericTextBlock*                CommonNumericTextRatingValue;                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox;                                     // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox;                                           // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         RatingValue;                                       // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FUniqueNetIdRepl                       UniqueId;                                          // 0x0240(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         InterpDuration;                                    // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Silhouette;                                 // 0x0270(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Chamfer;                                    // 0x0540(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Shadow;                                     // 0x0810(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeBrush                    MBrush_Icon;                                       // 0x0AE0(0x02D0)(Edit, BlueprintVisible)
	bool                                          OverrideDefaultColor;                              // 0x0DB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB1[0x3];                                      // 0x0DB1(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	struct FLinearColor                           Color_Light;                                       // 0x0DB4(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Medium;                                      // 0x0DC4(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_Dark;                                        // 0x0DD4(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Light;                               // 0x0DE4(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Medium;                              // 0x0DF4(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Default_Color_Dark;                                // 0x0E04(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E14[0x4];                                      // 0x0E14(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Icon_Alt;                                   // 0x0E18(0x02D0)(Edit, BlueprintVisible)
	bool                                          UseAlternateIcon;                                  // 0x10E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_10E9[0x7];                                     // 0x10E9(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	struct FFortMultiSizeBrush                    MBrush_Shadow_Alt;                                 // 0x10F0(0x02D0)(Edit, BlueprintVisible)
	struct FFortMultiSizeMargin                   MMargin_Alt;                                       // 0x13C0(0x0060)(Edit, BlueprintVisible, NoDestructor)
	struct FFortMultiSizeMargin                   MMargin;                                           // 0x1420(0x0060)(Edit, BlueprintVisible, NoDestructor)
	bool                                          ShowTeamPowerRating;                               // 0x1480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EFortBrushSize                                Brush_Size;                                        // 0x1481(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseRatingValuesFromPlayer;                        // 0x1482(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_RatingWidget_NUI(int32 EntryPoint);
	void PlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void Construct();
	void PlayerInfoChanged(const struct FUniqueNetIdRepl& UniqueId_0);
	void PreConstruct(bool IsDesignTime);
	void Update_Rating_Value(int32 Rating);
	void Update();
	void Set_Unique_ID(const struct FUniqueNetIdRepl& ID);
	void Update_From_Unique_ID();
	void Set_Texture2D_Parameter_From_Multi_Size_Brush(class UMaterialInstanceDynamic* Mid, class FName Parameter, const struct FFortMultiSizeBrush& MBrush);
	void Override_Default_Color_Set(bool Override, const struct FLinearColor& Light_Color, const struct FLinearColor& Medium_Color, const struct FLinearColor& Dark_Color);
	void SetShouldShowTeamPowerRating(bool ShowTeamRating);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RatingWidget_NUI_C">();
	}
	static class URatingWidget_NUI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URatingWidget_NUI_C>();
	}
};

}

