#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SocialTypes

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// ScriptStruct SocialTypes.ChatChromeColorScheme
// 0x0050 (0x0050 - 0x0000)
struct FChatChromeColorScheme final
{
public:
	struct FLinearColor                           ChatEntryBackgroundColor;                          // 0x0000(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           NoneActiveTabColor;                                // 0x0010(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColor;                                      // 0x0020(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TabFontColorInverted;                              // 0x0030(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ChatBackgroundColor;                               // 0x0040(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.ChatChromeStyle
// 0x06F8 (0x06F8 - 0x0000)
struct FChatChromeStyle final
{
public:
	struct FSlateBrush                            UserListBrush;                                     // 0x0000(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatBackgroundBrush;                               // 0x0078(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChatEntryBackgroundBrush;                          // 0x00F0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ChannelBackgroundBrush;                            // 0x0168(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            TabBackgroundBrush;                                // 0x01E0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           TabSelectorButtonStyle;                            // 0x0258(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                TabOptionPadding;                                  // 0x0490(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabContentPadding;                                 // 0x04A0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TabClosePadding;                                   // 0x04B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FButtonStyle                           UserListButtonStyle;                               // 0x04C0(0x0238)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.ChatChromeMargins
// 0x0064 (0x0064 - 0x0000)
struct FChatChromeMargins final
{
public:
	float                                         TabWidth;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                TabPadding;                                        // 0x0004(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowPadding;                                 // 0x0014(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatWindowToEntryMargin;                           // 0x0024(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ChatChannelPadding;                                // 0x0034(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListButtonPadding;                             // 0x0044(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                UserListIconPadding;                               // 0x0054(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.SocialSoundSchema
// 0x0048 (0x0048 - 0x0000)
struct FSocialSoundSchema final
{
public:
	struct FSlateSound                            MessageReceivedSound;                              // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            PartyInviteReceivedSound;                          // 0x0018(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FSlateSound                            FriendInviteReceivedSound;                         // 0x0030(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.ChatColorScheme
// 0x0120 (0x0120 - 0x0000)
struct FChatColorScheme final
{
public:
	struct FLinearColor                           TimeStampColor;                                    // 0x0000(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultChatColor;                                  // 0x0010(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperChatColor;                                  // 0x0020(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalChatColor;                                   // 0x0030(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderChatColor;                                  // 0x0040(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameChatColor;                                     // 0x0050(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamChatColor;                                     // 0x0060(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyChatColor;                                    // 0x0070(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           AdminChatColor;                                    // 0x0080(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameAdminChatColor;                                // 0x0090(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WhisperHyperlinkChatColor;                         // 0x00A0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GlobalHyperlinkChatColor;                          // 0x00B0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FounderHyperlinkChatColor;                         // 0x00C0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           GameHyperlinkChatColor;                            // 0x00D0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           TeamHyperlinkChatColor;                            // 0x00E0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           PartyHyperlinkChatColor;                           // 0x00F0(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EnemyColor;                                        // 0x0100(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FriendlyColor;                                     // 0x0110(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.SocialListMargins
// 0x0200 (0x0200 - 0x0000)
struct FSocialListMargins final
{
public:
	struct FVector2D                              UserPresenceImageSize;                             // 0x0000(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonMargin;                                // 0x0008(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListMargin;                                 // 0x0018(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListNoFriendsMargin;                        // 0x0028(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderMargin;                           // 0x0038(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendsListHeaderCountMargin;                      // 0x0048(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                HeaderButtonContentMargin;                         // 0x0058(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemMargin;                                  // 0x0068(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemStatusMargin;                            // 0x0078(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipStatusMargin;                             // 0x0088(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPresenceMargin;                          // 0x0098(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemPlatformMargin;                          // 0x00A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendItemTextScrollerMargin;                      // 0x00B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationBorderMargin;                          // 0x00C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonMargin;                          // 0x00D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ConfirmationButtonContentMargin;                   // 0x00E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                NoneFriendContentMargin;                           // 0x00F8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         NoneFriendContentHeight;                           // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoneFriendIconWidth;                               // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackIconMargin;                             // 0x0110(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuPageIconMargin;                             // 0x0120(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                RadioSettingTitleMargin;                           // 0x0130(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchIconMargin;                           // 0x0140(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSearchTextMargin;                           // 0x0150(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuBackButtonMargin;                           // 0x0160(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuSettingButtonMargin;                        // 0x0170(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                SubMenuListMargin;                                 // 0x0180(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         SubMenuSeperatorThickness;                         // 0x0190(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PresenceSeperatorThickness;                        // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipMargin;                                   // 0x0198(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipPresenceMargin;                           // 0x01A8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendTipSeperatorMargin;                          // 0x01B8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ToolTipMargin;                                     // 0x01C8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                TipStatusMargin;                                   // 0x01D8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                AddButtonMargin;                                   // 0x01E8(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AddButtonSpacing;                                  // 0x01F8(0x0008)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.ChatMarkupStyle
// 0x0590 (0x0590 - 0x0000)
struct FChatMarkupStyle final
{
public:
	struct FButtonStyle                           MarkupButtonStyle;                                 // 0x0000(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FTextBlockStyle                        MarkupTextStyle;                                   // 0x0238(0x01C8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MarkupBackground;                                  // 0x0400(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonColor;                                       // 0x0478(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverColor;                                  // 0x04A0(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            TipColor;                                          // 0x04C8(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x04F0(0x0078)(Edit, NativeAccessSpecifierPublic)
	float                                         SeperatorThickness;                                // 0x0568(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                MarkupPadding;                                     // 0x056C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                ButtonPadding;                                     // 0x057C(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_58C[0x4];                                      // 0x058C(0x0004)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SocialTypes.ChatStyle
// 0x1170 (0x1170 - 0x0000)
struct FChatStyle final
{
public:
	struct FEditableTextBoxStyle                  ChatEntryTextStyle;                                // 0x0000(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  ChatDisplayTextStyle;                              // 0x0728(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FScrollBoxStyle                        ScrollBorderStyle;                                 // 0x0E50(0x01E8)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            MessageNotificationBrush;                          // 0x1038(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                ChatEntryPadding;                                  // 0x10B0(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         ChatEntryHeight;                                   // 0x10C0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10C4[0x4];                                     // 0x10C4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateBrush                            ChatMenuBackgroundBrush;                           // 0x10C8(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionPadding;                               // 0x1140(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionHeaderPadding;                         // 0x1150(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMargin                                FriendActionStatusMargin;                          // 0x1160(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.SocialFontStyle
// 0x0240 (0x0240 - 0x0000)
struct FSocialFontStyle final
{
public:
	struct FSlateFontInfo                         FontSmall;                                         // 0x0000(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontSmallBold;                                     // 0x0058(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormal;                                        // 0x00B0(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontNormalBold;                                    // 0x0108(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLarge;                                         // 0x0160(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                         FontLargeBold;                                     // 0x01B8(0x0058)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultFontColor;                                  // 0x0210(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           InvertedFontColor;                                 // 0x0220(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DefaultDullFontColor;                              // 0x0230(0x0010)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.SocialListStyle
// 0x21F0 (0x21F0 - 0x0000)
struct FSocialListStyle final
{
public:
	struct FButtonStyle                           GlobalChatButtonStyle;                             // 0x0000(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            GlobalChatIcon;                                    // 0x0238(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendItemButtonStyle;                             // 0x02B0(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ConfirmButtonStyle;                                // 0x04E8(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           CancelButtonStyle;                                 // 0x0720(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonContentColor;                                // 0x0958(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ButtonHoverContentColor;                           // 0x0980(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowBrush;                              // 0x09A8(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ActionMenuArrowRightBrush;                         // 0x0A20(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateColor                            ActionMenuBackgroundColor;                         // 0x0A98(0x0028)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ToolTipArrowBrush;                                 // 0x0AC0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           BackButtonStyle;                                   // 0x0B38(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           HeaderButtonStyle;                                 // 0x0D70(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           FriendListActionButtonStyle;                       // 0x0FA8(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AddFriendButtonContentBrush;                       // 0x11E0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            StatusIconBrush;                                   // 0x1258(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PCIconBrush;                                       // 0x12D0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            ConsoleIconBrush;                                  // 0x1348(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            EpicIconBrush;                                     // 0x13C0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendImageBrush;                                  // 0x1438(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OfflineBrush;                                      // 0x14B0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            OnlineBrush;                                       // 0x1528(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            AwayBrush;                                         // 0x15A0(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SpectateBrush;                                     // 0x1618(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsContainerBackground;                        // 0x1690(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FriendsListBackground;                             // 0x1708(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FEditableTextBoxStyle                  AddFriendEditableTextStyle;                        // 0x1780(0x0728)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            BackBrush;                                         // 0x1EA8(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SelectedOptionBrush;                               // 0x1F20(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SettingsBrush;                                     // 0x1F98(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SeperatorBrush;                                    // 0x2010(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            PresenceSeperatorBrush;                            // 0x2088(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            FontSizeBrush;                                     // 0x2100(0x0078)(Edit, NativeAccessSpecifierPublic)
	struct FSlateBrush                            SearchBrush;                                       // 0x2178(0x0078)(Edit, NativeAccessSpecifierPublic)
};

// ScriptStruct SocialTypes.ProfanityData
// 0x0038 (0x0038 - 0x0000)
struct FProfanityData final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProfanityList;                                     // 0x0010(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WhiteList;                                         // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoAdd;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-8 ])
};

// ScriptStruct SocialTypes.SocialStyle
// 0x5D60 (0x5D60 - 0x0000)
struct FSocialStyle final
{
public:
	struct FScrollBarStyle                        ScrollBarStyle;                                    // 0x0000(0x0440)(Edit, NativeAccessSpecifierPublic)
	struct FButtonStyle                           ActionButtonStyle;                                 // 0x0440(0x0238)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       SmallFontStyle;                                    // 0x0678(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       NormalFontStyle;                                   // 0x08B8(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       LargeFontStyle;                                    // 0x0AF8(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FSocialFontStyle                       ChatFontStyle;                                     // 0x0D38(0x0240)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         CheckBoxStyle;                                     // 0x0F78(0x04F0)(Edit, NativeAccessSpecifierPublic)
	struct FCheckBoxStyle                         RadioBoxStyle;                                     // 0x1468(0x04F0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListStyle                       SocialListStyle;                                   // 0x1958(0x21F0)(Edit, NativeAccessSpecifierPublic)
	struct FSocialListMargins                     SocialListMargins;                                 // 0x3B48(0x0200)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatStyle                             ChatStyle;                                         // 0x3D48(0x1170)(Edit, NativeAccessSpecifierPublic)
	struct FChatColorScheme                       ChatColorScheme;                                   // 0x4EB8(0x0120)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeStyle                       ChatChromeStyle;                                   // 0x4FD8(0x06F8)(Edit, NativeAccessSpecifierPublic)
	struct FChatChromeMargins                     ChatChromeMargins;                                 // 0x56D0(0x0064)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FChatChromeColorScheme                 ChatChromeColorScheme;                             // 0x5734(0x0050)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5784[0x4];                                     // 0x5784(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FChatMarkupStyle                       ChatMarkupStyle;                                   // 0x5788(0x0590)(Edit, NativeAccessSpecifierPublic)
	struct FSocialSoundSchema                     SoundSchema;                                       // 0x5D18(0x0048)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

}

