#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: StatusWidget

#include "Basic.hpp"


namespace SDK::Params
{

// Function StatusWidget.StatusWidget_C.ExecuteUbergraph_StatusWidget
// 0x0004 (0x0004 - 0x0000)
struct StatusWidget_C_ExecuteUbergraph_StatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function StatusWidget.StatusWidget_C.SetStatusText
// 0x0018 (0x0018 - 0x0000)
struct StatusWidget_C_SetStatusText final
{
public:
	class FText                                   Status;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function StatusWidget.StatusWidget_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct StatusWidget_C_SetTitleText final
{
public:
	class FText                                   TitleText_0;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};

// Function StatusWidget.StatusWidget_C.UpdateLoginStatusText
// 0x0038 (0x0038 - 0x0000)
struct StatusWidget_C_UpdateLoginStatusText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLoginStatusText_ReturnValue;           // 0x0020(0x0018)()
};

}

